{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "embedding/embeddings", "shape": [67, 256], "dtype": "float32"}, {"name": "lstm_layer0/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_layer0/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_layer0/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_layer1_1/kernel", "shape": [128, 1024], "dtype": "float32"}, {"name": "lstm_layer1_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_layer1_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "lstm_layer2_1/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_layer2_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_layer2_1/bias", "shape": [512], "dtype": "float32"}, {"name": "time_distributed_1/kernel", "shape": [768, 67], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [67], "dtype": "float32"}]}]}