{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 30], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "embedding", "class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 67, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "drop_layer1", "class_name": "Dropout", "config": {"name": "drop_layer1", "trainable": true, "rate": 0.0, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "lstm_layer0", "class_name": "LSTM", "config": {"name": "lstm_layer0", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["drop_layer1", 0, 0, {}]]]}, {"name": "lstm_layer1", "class_name": "LSTM", "config": {"name": "lstm_layer1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lstm_layer0", 0, 0, {}]]]}, {"name": "lstm_layer2", "class_name": "LSTM", "config": {"name": "lstm_layer2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lstm_layer1", 0, 0, {}]]]}, {"name": "rnn_concat", "class_name": "Concatenate", "config": {"name": "rnn_concat", "trainable": true, "axis": -1}, "inbound_nodes": [[["embedding", 0, 0, {}], ["lstm_layer0", 0, 0, {}], ["lstm_layer1", 0, 0, {}], ["lstm_layer2", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 67, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["rnn_concat", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["time_distributed_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "embedding/embeddings", "shape": [67, 256], "dtype": "float32"}, {"name": "lstm_layer0/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_layer0/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_layer0/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_layer1/kernel", "shape": [128, 1024], "dtype": "float32"}, {"name": "lstm_layer1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_layer1/bias", "shape": [1024], "dtype": "float32"}, {"name": "lstm_layer2/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_layer2/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_layer2/bias", "shape": [512], "dtype": "float32"}, {"name": "time_distributed_1/kernel", "shape": [768, 67], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [67], "dtype": "float32"}]}]}