{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "embd_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [1, 30], "dtype": "float32", "input_dim": 52, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "LSTM", "config": {"name": "lstm_0_128", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.15, "recurrent_dropout": 0.15, "implementation": 1}}, {"class_name": "LSTM", "config": {"name": "lstm_1_256", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.15, "recurrent_dropout": 0.15, "implementation": 1}}, {"class_name": "LSTM", "config": {"name": "lstm_2_128", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": true, "unroll": false, "units": 128, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.15, "recurrent_dropout": 0.15, "implementation": 1}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 52, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [128, 52], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [52], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [52, 256], "dtype": "float32"}, {"name": "lstm_0_128/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_0_128/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_0_128/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_1_256/kernel", "shape": [128, 1024], "dtype": "float32"}, {"name": "lstm_1_256/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "lstm_1_256/bias", "shape": [1024], "dtype": "float32"}, {"name": "lstm_2_128/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_2_128/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_2_128/bias", "shape": [512], "dtype": "float32"}]}]}