LSTMSkipConnection_many2many_128_256_128_layers_lstm
epochs: 300

Model choice: LayersRNNGeneric
Drop Rate: 0.15
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (100, 30, 256)            13312     
_________________________________________________________________
lstm_layer0 (LSTM)           (100, 30, 128)            197120    
_________________________________________________________________
dropout_1 (Dropout)          (100, 30, 128)            0         
_________________________________________________________________
lstm_layer1 (LSTM)           (100, 30, 256)            394240    
_________________________________________________________________
dropout_2 (Dropout)          (100, 30, 256)            0         
_________________________________________________________________
lstm_layer2 (LSTM)           (100, 30, 128)            197120    
_________________________________________________________________
dropout_3 (Dropout)          (100, 30, 128)            0         
_________________________________________________________________
time_distributed_1 (TimeDist (100, 30, 52)             6708      
_________________________________________________________________
activation_1 (Activation)    (100, 30, 52)             0         
=================================================================
Total params: 808,500
Trainable params: 808,500
Non-trainable params: 0