crane model name: 04_24_19_LSTMSkipConnection_classical_small_drop45_128_256_128_batchsize20_window30
epochs: 14 (chosen via early stopping)

Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           (1, 30)                   0         
_________________________________________________________________
embedding (Embedding)        (1, 30, 256)              8704      
_________________________________________________________________
drop_layer1 (Dropout)        (1, 30, 256)              0         
_________________________________________________________________
lstm_layer0 (LSTM)           (1, 30, 128)              197120    
_________________________________________________________________
lstm_layer1 (LSTM)           (1, 30, 256)              394240    
_________________________________________________________________
lstm_layer2 (LSTM)           (1, 30, 128)              197120    
_________________________________________________________________
rnn_concat (Concatenate)     (1, 30, 768)              0         
_________________________________________________________________
time_distributed_1 (TimeDist (1, 30, 34)               26146     
=================================================================
Total params: 823,330.0
Trainable params: 823,330.0
Non-trainable params: 0.0
_________________________________________________________________

 None

